---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored
source: html/96d8dbac-a77e-5a96-5469-bc36883264ac.htm
---
# VertexPositionNormalColored Members

Constructs the vertex from a point, a normal vector, and a color.